#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-kG5r7sAnqLyaYzea

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-dev-state-locking]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_cloudwatch_event_rule.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.app: Refreshing state... [id=guevy4]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=etb5fq]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=bog9v3]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=ogj40z]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=qorb7e]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-gcp9dahm4c-bog9v3-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-ogj40z-GET]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-qorb7e-GET]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-ogj40z-GET-200]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-gcp9dahm4c-ogj40z-GET]
aws_lambda_function.siteminder-tests-scheduler: Refreshing state... [id=lambda-siteminder-tests-scheduler]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-gcp9dahm4c-qorb7e-GET]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-qorb7e-GET-200]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-gcp9dahm4c-ogj40z-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-gcp9dahm4c-qorb7e-GET-200]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler-siteminder-tests-scheduler]
aws_lambda_permission.siteminder-tests-scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.app: Refreshing state... [id=agi-gcp9dahm4c-bog9v3-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=i2174j]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-12-16T20:00:05.031Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-12-16T20:00:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "0Mk01seK+PBJXTPEcvkgglSTHU/iWTfTnx6HLdunEJc=" -> "3qWASyyHiU+85rgTvX85sZbolPn6OWeVuSWOkab+g5c="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-12-16T20:00:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "SkkE+s6NTCCgE3LQjmpwqECxqQX57HRkOSdcYjr8zD4=" -> "V0ec573oMt86CIkmz7e3stUrzd9guSCXk7ZqczyRJ2E="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-12-16T20:00:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "GRP1xu9Y+qLkFTXjLgFPyNd1J9AS4IT9wh34EF4MTCg=" -> "2hu9NtB0f3x3SN1/UHNMb4VwFIBOGy43S9ekxT6NH8Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-12-16T19:59:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "Az9DCTPpVbOtK0cvA74oSNxB76JUbgPW9rQkYuOG38k=" -> "oAVYhwubHHJmgFWHEBam9Ijq40KeS3GUYvQ2x33EizU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-12-16T20:00:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "S8qZn0xear+d2m8TFdBne2c/l+XKpZITICyMq7DfOL8=" -> "9MjPczFpp7Le2flCc4dv+GEd9UNd/m2P8+FiFn3OZg0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.siteminder-tests-scheduler will be updated in-place
  ~ resource "aws_lambda_function" "siteminder-tests-scheduler" {
        id                             = "lambda-siteminder-tests-scheduler"
      ~ last_modified                  = "2022-12-16T19:59:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "7zmqvNbLTpC3J6LxMyIKeUohBT79oeh5ZxGmVidVGxM=" -> "CIp/SYCfPBG/Ae/o/Pxeuyrq1/Tyl1YIQ5moFXz0Szk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.s3_sso_loki.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "xgr00q-dev-sso-loki"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_sso_loki.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "xgr00q-dev-sso-loki"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_sso_loki.aws_s3_bucket_cors_configuration.this will be created
  + resource "aws_s3_bucket_cors_configuration" "this" {
      + bucket = "xgr00q-dev-sso-loki"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3_sso_loki.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_sso_loki.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "xgr00q-dev-sso-loki"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

Plan: 5 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-12-16T20:00:05.031Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 37 estimated
           $178.56/mo +$0.0

```

</details>

*Pusher: @junminahn, Action: `pull_request`*